"""

Задача №1

Послідовність складається з різних натуральних чисел і завершується числом 0.
Визначте значення другого за величиною елемента в цій послідовності.
Вводиться послідовність цілих чисел, що закінчується числом 0
(саме число 0 в послідовність не входить, а використовується як ознакаїї закінчення).
Гарантується, що в послідовності є хоча б два елементи.

Виконала: Гриб Наталія Григорівна, 31І група
"""

#Ініціалізуємо список для збереження введених чисел
numbers = []

#Зчитуємо перше число
num = int(input("Введіть число (0 для завершення): "))

#Зчитуємо числа, доки не введено 0
while num != 0:
    numbers.append(num)
    num = int(input("Введіть число (0 для завершення): "))

#Перевіряємо, чи список має щонайменше два елементи
if len(numbers) >=2:
    #Сортуємо у порядку спадання
    numbers.sort(reverse=True)

    #Виводимо другий за величиною елемент
    print("Другий за величиною елемент:", numbers[1])
else:
    print("У послідовності має бути щонайменше два елементи.")
